import React, {useEffect} from "react";
import gravel from "../../assets/Exchange/gavel-2.png"
import exchange from "../../assets/Exchange/exchange-2.png";
import returnpng from "../../assets/Exchange/return-2.png"
import "./Exchange.scss"
import {connect} from "react-redux";
import {languageOperations} from "../../store/language";


function  Exchange ({dispatch, language }){
    const uk = {
        title: "Обмін та Повернення",
        c1h2: "ЗУ \"Про захист прав споживачів\"",
        c1span1: "Відповідно до Закону України «Про захист прав споживачів»",
        c1p1: "від 19.03.1994 року №172 клієнти мають право обміняти непродовольчий товар належної якості на аналогічний, якщо товар не задовольнив його за формою, габаритами, фасоном, кольором, розміром або з інших причин не може бути ним використаний за призначенням. Покупець має право на обмін товару належної якості протягом чотирнадцяти календарних днів, не рахуючи дня покупки за умови виконання всіх норм передбачених Законом.",
        c1p2: "Постановою Кабінету Міністрів України від 19 березня 1994 року № 172 «Про реалізацію окремих положень Закону України « Про захист прав споживачів» позначений перелік товарів, що не підлягають обміну (поверненню), а саме:",
        c1li1:"щітки для волосся, гребінці, масажні щітки;",
        c1li2:"одноразова продукція;",
        c1li3:"пензлі та набори пензлів;",
        c1li4:"пилки, бафи, полірувальники;",
        c1li5:"перукарські ножиці;",
        c1li6:"манікюрні інструменти;",
        c1li7:"лаки і гель-лаки;",
        c1li8:"товари в аерозольній упаковці;",
        c1li9:"шпильки і шпильки для волосся;",
        c1li10:"акційні та знижені в ціні товари;",
        c1li11:"друковані видання;",
        c1li12:"апарати для гоління",
        c1li13:"вироби з натурального та штучного волосся",
        c1p3: "Такий товар можна повернути тільки через виявлення браку або невідповідності замовлення.",

        c2h2: "Що можна повернути?",
        c2p1: "Обміну або поверненню підлягає тільки новий товар, який не має слідів використання: подряпин, сколів, потертостей.",
        c2p2: "Обов'язково бути збережені: комплектація, цілісність і всі компоненти упаковки, ярлики, заводське маркування. Порушення будь-якого з цих пунктів залишає за магазином право відмовити покупцеві в обміні або поверненні товару.",
        c2span3: "Забираючи товар з відділення Нової Пошти Ви автоматично погоджуєтеся з якістю і комплектацією товару. Переконливе прохання перевіряти посилку при співробітнику кур'єрської служби / кур'єрі.",

        c3h2: "Процедура обміну та повернення товару",
        c3h3: "Техніка належної якості, яка вводилася в експлуатацію не підлягає обміну/поверненню",
        c3p1: "Покупець має право розраховувати на гарантійний ремонт, якщо:",
        c3li1: "на товар встановлено гарантійний термін.",
        c3li2: "товар придбаний в магазині WINS.",
        c3li3: "терміни гарантії вказані в додатку до товару.",

        c4h3: "Процедура обміну/повернення техніки неналежної якості, яка вводилася в експлуатацію:",
        c4p1: "1. Клієнт заповнює зворотну форму, разом із співробітником, надаючи всю необхідну інформацію",
        c4p2: "2. Після узгодження з менеджером клієнт відправляє товар в інтернет-магазин (за рахунок клієнта). Протягом 5-ти робочих днів з моменту надходження товару проводиться діагностика.",
        c4p3: "3. Якщо підтверджується заводський брак, клієнт має право на гарантійний ремонт.",
        c4p4: "4. Якщо брак товару не виявлено, проводиться ремонт техніки",
        c4p5: "Повернення техніки яка не вводилася в експлуатацію, можливе протягом 14-ти днів при наявності чеку і всієї комплектації.",
        c4span5: " Зворотне пересилання здійснюється за рахунок покупця.",

        c5h3: "Процедура обміну/повернення техніки неналежної якості, що не вводилася в експлуатацію:",
        c5p1: "1. Клієнт заповнює зворотну форму, разом із співробітником, надаючи всю необхідну інформацію",
        c5p2: "2. Якщо пройшло більше 14-ти днів, товар відправляється на діагностику в сервісний центр, протягом 5-ти робочих днів з моменту надходження товару на діагностику менеджер надає інформацію для прийняття подальших дій.",
        c5p3: "* гарантійний ремонт техніки, яка не вводилася в експлуатацію, здійснюється за рахунок інтернет-магазину",
        c5p4: "Товар (гель-лаки, лаки, гелі і т.д) належної якості, який вводився в експлуатацію не підлягає обміну або поверненню.",
        c5p5: "Товар (гель-лаки, лаки, гелі і т.д) належної якості, які не вводилися в експлуатацію підлягає обміну або поверненню тільки у разі невідповідності замовлення.",

        c6h3: "Процедура обміну/повернення товару (гель-лаки, лаки, гелі і т.д) неналежної якості, який вводився /не вводився в експлуатацію:",
        c6p1: "1.Клієнт заповнює зворотну форму, разом із співробітником, надаючи всю необхідну інформацію",
        c6p2: "2. Після узгодження з менеджером клієнт відправляє товар в інтернет-магазин (за рахунок клієнта). Протягом 5 робочих днів з моменту надходження товару проводиться діагностика. Результат обміну / повернення буде відомий після проведення діагностики.",
        c6p3: "3. При підтвердженні браку магазин компенсує куплений товар, якщо брак не виявлений - товар буде відправлений покупцеві, без компенсації коштів за пересилання.",
        c6span3: "Зворотне пересилання здійснюється за рахунок покупця.",
    }
    const ru = {
        title: "Обмен и Возврат",
        c1h2: "ЗУ \"О защите прав потребителей\"",
        c1span1: "В соответствии с Законом Украины «О защите прав потребителей»",
        c1p1: "от 19.03.1994 года №172 клиенты имеют право обменять непродовольственный товар надлежащего качества на аналогичный, если товар не удовлетворил его по форме, габаритам, фасону, цвету, размеру или по другим причинам не может быть им использован по назначению. Покупатель имеет право на обмен товара надлежащего качества в течение четырнадцати календарных дней, не считая дня покупки при условии выполнение всех норм предусмотренных Законом.",
        c1p2: "Постановлением Кабинета Министров Украины от 19 марта 1994 года № 172 \"О реализации отдельных положений Закона Украины \"О защите прав потребителей\" указан перечень товаров, не подлежащих обмену (возвращению), а именно:",
        c1li1:"щетки для волос, расчески, массажные щетки;",
        c1li2:"одноразовая продукция;",
        c1li3:"кисти и наборы кистей;",
        c1li4:"пилы, бафы, полировщики;",
        c1li5:"парикмахерские ножницы;",
        c1li6:"маникюрные инструменты;",
        c1li7:"лаки и гель-лаки;",
        c1li8:"товары в аэрозольной упаковке;",
        c1li9:"шпильки и шпильки для волос;",
        c1li10:"акционные и уцененные товары;",
        c1li11:"печатные издания;",
        c1li12:"аппараты для бритья",
        c1li13:"изделия из натуральных и искусственных волос",
        c1p3: "Такой товар можно вернуть только из-за обнаружения брака или несоответствия заказа.",

        c2h2: "Что можно вернуть?",

        c2p1: "Обмену или возврату подлежит только новый товар, не имеющий следов использования: царапин, сколов, потертостей.",
        c2p2: "Обязательно быть сохранены: комплектация, целостность и все компоненты упаковки, ярлыки, заводская маркировка. Нарушение любого из этих пунктов оставляет за магазином право отказать покупателю в обмене или возврате товара.",
        c2span3: "Забирая товар из отделения Новой Почты Вы автоматически соглашаетесь с качеством и комплектацией товара. Убедительная просьба проверять посылку при сотруднике курьерской службы/курьере.",

        c3h2: "Процедура обмена и возврата товара",

        c3h3: "Техника надлежащего качества, которая вводилась в эксплуатацию, не подлежит обмену/возврату",
        c3p1: "Покупатель имеет право рассчитывать на гарантийный ремонт, если:",
        c3li1: "на товар установлен гарантийный срок.",
        c3li2: "товар приобретен в магазине WINS.",
        c3li3: "сроки гарантии указаны в приложении к товару.",

        c4h3: "Процедура обмена/возврата техники ненадлежащего качества, которая вводилась в эксплуатацию:",
        c4p1: "1. Клиент заполняет обратную форму вместе с сотрудником, предоставляя всю необходимую информацию",
        c4p2: "2. После согласования с менеджером клиент отправляет товар в интернет-магазин (за счет клиента). В течение 5 рабочих дней с момента поступления товара проводится диагностика.",
        c4p3: "3. Если подтверждается заводской брак, клиент имеет право на гарантийный ремонт.",
        c4p4: "4. Если нехватка товара не обнаружена, производится ремонт техники",
        c4p5: "Возврат техники не вводимой в эксплуатацию возможно в течение 14-ти дней при наличии чека и всей комплектации.",
        c4span5: "Обратная пересылка осуществляется за счет покупателя.",

        c5h3: "Не вводимая в эксплуатацию процедура обмена/возврата техники ненадлежащего качества:",
        c5p1: "1. Клиент заполняет обратную форму вместе с сотрудником, предоставляя всю необходимую информацию",
        c5p2: "2. Если прошло более 14 дней, товар отправляется на диагностику в сервисный центр, в течение 5 рабочих дней с момента поступления товара на диагностику менеджер предоставляет информацию для принятия дальнейших действий.",
        c5p3: "* гарантийный ремонт техники, которая не вводилась в эксплуатацию, осуществляется за счет интернет-магазина",
        c5p4: "Товар (гель-лаки, лаки, гели и т.д) надлежащего качества, который вводился в эксплуатацию, не подлежит обмену или возврату.",
        c5p5: "Товар (гель-лаки, лаки, гели и т.д) надлежащего качества, которые не вводились в эксплуатацию, подлежит обмену или возврату только в случае несоответствия заказа.",

        c6h3: "Процедура обмена/возврата товара (гель-лаки, лаки, гели и т.д) ненадлежащего качества, которое вводилось/не вводилось в эксплуатацию:",
        c6p1: "1.Клиент заполняет обратную форму вместе с сотрудником, предоставляя всю необходимую информацию",
        c6p2: "2. После согласования с менеджером клиент отправляет товар в интернет-магазин (за счет клиента). В течение 5 рабочих дней с момента поступления товара проводится диагностика. Результат обмена/возврата будет известен после проведения диагностики.",
        c6p3: "3. При подтверждении брака магазин компенсирует купленный товар, если брак не обнаружен - товар будет отправлен покупателю, без компенсации средств за пересылку.",
        c6span3: "Обратная пересылка осуществляется за счет покупателя.",

    }
    let mainLang = uk;

    useEffect(()=>{
        dispatch(languageOperations.getLanguage())
    }, [dispatch])

    if(language === "uk"){
        mainLang = uk;
    }
    if(language === "ru"){
        mainLang = ru;
    }
    return(
        <div className="wrapper exchange_block">
            <div className="exchange_title_block">
                <h1>{mainLang.title}</h1>
                <div></div>
            </div>
            <div className="exchange_item_title">
                <img src={gravel}/>
                <h2>{mainLang.c1h2}</h2>
            </div>
            <div className="exchange_item_box">
                <p><span>{mainLang.c1span1}</span> {mainLang.c1p1}</p>
                <div></div>
                <p>{mainLang.c1p2}</p>
                <div></div>
                <ul>
                    <li>{mainLang.c1li1}</li>
                    <li>{mainLang.c1li2}</li>
                    <li>{mainLang.c1li3}</li>
                    <li>{mainLang.c1li4}</li>
                    <li>{mainLang.c1li5}</li>
                    <li>{mainLang.c1li6}</li>
                    <li>{mainLang.c1li7}</li>
                    <li>{mainLang.c1li8}</li>
                    <li>{mainLang.c1li9}</li>
                    <li>{mainLang.c1li10}</li>
                    <li>{mainLang.c1li11}</li>
                    <li>{mainLang.c1li12}</li>
                    <li>{mainLang.c1li13}</li>
                </ul>
                <div></div>
                <p>{mainLang.c1p3}</p>
            </div>
            <div className="exchange_item_title">
                <img src={exchange}/>
                <h2>{mainLang.c2h2}</h2>
            </div>
            <div className="exchange_item_box">
                <p>{mainLang.c2p1}</p>
                <div></div>
                <p>{mainLang.c2p2}</p>
                <div></div>
                <p><span>{mainLang.c2span3}</span></p>
            </div>
            <div className="exchange_item_title">
                <img src={returnpng}/>
                <h2>{mainLang.c3h2}</h2>
            </div>
            <div className="exchange_main_item_box">
                <h3>{mainLang.c3h3}</h3>
                <p>{mainLang.c3p1}</p>
                <ul>
                    <li>{mainLang.c3li1}</li>
                    <li>{mainLang.c3li2}</li>
                    <li>{mainLang.c3li3}</li>
                </ul>
                <div></div>
                <h3>{mainLang.c4h3}</h3>
                <p>{mainLang.c4p1}</p>
                <p>{mainLang.c4p2}</p>
                <p>{mainLang.c4p3}</p>
                <p>{mainLang.c4p4}</p>
                <p>{mainLang.c4p5} <span>{mainLang.c4span5}</span></p>
                <div></div>
                <h3>{mainLang.c5h3}</h3>
                <p>{mainLang.c5p1}</p>
                <p>{mainLang.c5p2}</p>
                <p>{mainLang.c5p3}</p>
                <p>{mainLang.c5p4}</p>
                <p>{mainLang.c5p5}</p>
                <div></div>
                <h3>{mainLang.c6h3}</h3>
                <p>{mainLang.c6p1}</p>
                <p>{mainLang.c6p2}</p>
                <p>{mainLang.c6p3} <span>{mainLang.c6span3}</span></p>
            </div>
        </div>
    )
}

const mapStateToProps = (state) => {
    return {
        language: state.language.data,
    };
};

export default connect(mapStateToProps) (Exchange);