import React, {useEffect} from "react";
import {languageOperations} from "../../store/language";
import {connect} from "react-redux";
import "./Delivery.scss"

function Delivery ({dispatch, language }){
    const uk={
        title: "Доставка",

        c1h2: "Нова Пошта",
        c1p1: "Доставка у відділення/поштомат або кур'єром Нової Пошти за адресою.",
        c1p2: "Термін доставки залежить від ситуації у регіоні. ",
        c1p3: "Доставку оплачує або покупець, або інтернет-магазин WINS залежно від інформації, зазначеної в товарах.",
        c1p4: "Слідкуйте за статусом посилки на сайті «Нова пошта», або в мобільному додатку. Після надходження посилки до пункту видачі ви отримаєте відповідне повідомлення. ",
        c1p5: "Безкоштовне зберігання посилок у відділеннях здійснюється протягом 7 календарних днів, далі послуга платна.",

        c2h3: "Самовивіз із відділення \"Нова Пошта\":",
        c2p1: "1. Оплата товару та послуг з доставки Нова Пошта оплачуються готівкою у гривнях.",
        c2p2: "2. Оплата товару та послуг з доставки Нова Пошта оплачуються за допомогою банківської картки.",

        c3h3: "Доставка \"Нова Пошта\" до поштоматів:",
        c3p1: "Що доставляємо: будь-який товар вартістю до 10000 гривень та вагою до 30 кг та розмірами не більше 42x34x58 см.",
        c3p2: "Коли доставляємо: згідно з термінами доставки оператора «Нова Пошта» до вашого міста. Деталі за посиланням: https://novaposhta.ua/",
        c3p3: "Куди доставляємо: до будь-якої пошти «Нова Пошта». Список поштоматів за посиланням: https://novaposhta.ua/office/list",
        c3p4: "Переваги: безконтактний спосіб отримання замовлення. Забрати посилку можна у будь-який зручний час, навіть у вихідні чи святкові дні.",
        c3p5: "Оплата замовлення: тільки повністю передплачені замовлення. Отримати посилку можна лише за 10 секунд!",
        c3p6: "Щоб скористатися поштоматом, не потрібно мати при собі документи. Все, що потрібно взяти з собою: мобільний телефон із встановленим мобільним додатком «Нова Пошта».",

        c4h3: "Правила доставки до поштоматів:",
        c4p1: "Відповідно до офіційних умов надання послуг ТОВ «Нова Пошта». Посилання на правила: https://novaposhta.ua/uploads/misc/doc/Terms_of_Service.pdf Безкоштовне зберігання замовлення 6 днів у поштоматі, на 7-й день переміщення до відділення. Якщо після закінчення цього терміну ви не отримаєте замовлення, товар повернеться до магазину. В одному замовленні може бути не більше однієї одиниці товару. За потреби замовлення більше 1 одиниці - необхідно оформити замовлення окремо на кожен товар. При технічних проблемах, які виникли з поштоматом, необхідно звернутися до контакт-центру компанії «Нова Пошта» за номером 0 800 500 609.",
        c4p2: "За фактом доставки можна провести перевірку посилки на цілісність та працездатність. У разі виявлення пошкоджень, невідповідності товару або його комплектації необхідно у присутності оператора відділення або кур'єра Нової пошти скласти відповідний акт та відмовитися від отримання посилки. Після отримання товару претензії до зовнішнього вигляду та комплектації не приймаються.",
        c4p3: "Для отримання товару в поштоматі потрібна встановлена на смартфон програма Нової Пошти. У ньому ж сплачується доставка посилки. У разі виявлення пошкоджень, невідповідності товару або його комплектації, необхідно звернутися до будь-якого відділення або зателефонувати до служби підтримки Нової Пошти для подання претензії.",

        c5h3: "Інструкція як користуватися поштоматом: ",
        c5p1: "Посилання на інструкцію: https://novaposhta.ua/poshtomat/?utm_source=site&utm_medium=referral&utm_campaign=npu_poshtomat_button",

        c6h3: "Вартість доставки",
        c6p1: "1. Вартість доставки розраховується індивідуально та залежить від ваги, обсягу товару, а також населеного пункту.",
        c6p2: "2. Безкоштовна доставка при 100% оплаті товару від 2000 грн.",
        c6p3: "3. При оплаті післяплатою, до суми замовлення додається 20 грн+2% від вартості товару (послуги Нової пошти за пересилання грошей).",

        c7h2: "Укрпошта",
        c7p1: "Доставка здійснюється у відділення Укрпошти у вашому місті",
        c7p2: "Замовлення може бути на суму до 50000 грн, не більше 70 см (максимальна сторона) та вагою до 30 кг.",

        c8h3:"Відправлення здійснюється за тарифами Укрпошта:",
        c8p1: "Експрес https://www.ukrposhta.ua/ua/taryfy-ukrposhta-ekspres",
        c8p2: "Стандарт https://www.ukrposhta.ua/ua/taryfy-ukrposhta-standart",
        c8p3: "Надсилання товару транспортною компанією можливе лише при повній оплаті вартості товару на розрахунковий рахунок ФОП. Покладений платіж відсутній",
        c8p4: "Доставку оплачує покупець або інтернет-магазин WINS залежно від інформації, зазначеної в товарах.",
        c8p5: "Щоб отримати відправлення у відділенні:",
        c8p6: "1. Перевірте по трекінгу на сайті Укрпошта (https://track.ukrposhta.ua/tracking_UA.html) або в мобільному додатку (https://www.ukrposhta.ua/ua/onlain-servisy#mobile-app -block)",
        c8p7: "2. Знайдіть адресу свого відділення Укрпошти за індексом або домашньою адресою тут (https://index.ukrposhta.ua/find-post-index)",
        c8p8: "3. Покажіть працівнику Укрпошти оригінал документа, що посвідчує особу (паспорт, посвідчення водія, посвідку на проживання тощо), або з додатка Дія або документ, який дає можливість отримувати відправлення.",
        c8p9: "4. Отримайте свою посилку.",
        c8p10: "Терміни доставки залежать від ситуації в регіоні.",
        c8p11: "За фактом доставки ви маєте можливість перевірити товар на цілісність та працездатність.",
        c8p12: "У разі виявлення пошкоджень, невідповідності товару або його комплектації, необхідно у присутності оператора відділення Укрпошти скласти відповідний акт та відмовитися від отримання посилки.",
        c8p13: "Після отримання товару претензії до зовнішнього вигляду та комплектації не приймаються.",

        c9h3: "Вартість доставки",
        c9p1: "1. Вартість доставки розраховується індивідуально та залежить від ваги, обсягу товару, а також населеного пункту.",
        c9p2: "2. Безкоштовна доставка при 100% оплаті товару від 2000 грн.",
    };
    const ru={
        title: "Доставка",

        c1h2: "Новая Почта",
        c1p1:"Доставка в отделение/почтомат или курьером Новой Почты по адресу.",
        c1p2: "Срок доставки зависит от ситуации в регионе. ",
        c1p3: "Доставку оплачивает либо покупатель, либо интернет-магазин WINS в зависимости от информации указанной в товарах. ",
        c1p4: "Отслеживайте статус посылки на сайте «Новая почта», или в мобильном приложении. После поступления посылки в пункт выдачи вы получите соответствующее уведомление. ",
        c1p5: "Бесплатное хранение посылок в отделениях осуществляется в течение 7 календарных дней, далее услуга платная.",

        c2h3: "Самовывоз из отделения \"Нова Пошта\":",
        c2p1: "1. Оплата товара и услуг по доставке Новая Почта оплачиваются наличными в гривнах.",
        c2p2: "2. Оплата товара и услуг по доставке Новая Почта оплачиваются с помощью банковской карты.",

        c3h3: "Доставка \"Нова Пошта\" в почтоматы:",
        c3p1: "Что доставляем: любой товар стоимостью до 10000 гривен и весом до 30 кг и размерами не более 42x34x58 см.",
        c3p2: "Когда доставляем: согласно сроков доставки оператора «Нова Пошта» в ваш город. Детали по ссылке: https://novaposhta.ua/",
        c3p3: "Куда доставляем: к любому почтомату «Нова Пошта». Список почтоматов по ссылке: https://novaposhta.ua/office/list",
        c3p4: "Преимущества: бесконтактный способ получения заказа. Забрать посылку можно в любое удобное время, даже в выходные или праздничные дни.",
        c3p5: "Оплата заказа: только полностью предоплаченные заказы. Получить посылку можно всего за 10 секунд!",
        c3p6: "Чтобы воспользоваться почтоматом, не нужно иметь при себе документы. Все, что нужно взять с собой: мобильный телефон с установленным мобильным приложением «Нова Пошта».",

        c4h3: "Правила доставки в почтоматы:",
        c4p1: "Согласно официальным условиям предоставления услуг ООО «Нова Пошта». Ссылка на правила: https://novaposhta.ua/uploads/misc/doc/Terms_of_Service.pdf Бесплатное хранение заказа 6 дней в почтомате, на 7-й день перемещения в отделение. Если по истечении этого срока вы не получите заказ, товар вернется в магазин. В одном заказе может быть не более 1 единицы товара. При необходимости заказа более 1 единицы - необходимо оформить заказ отдельно на каждый товар. При технических проблемах, которые возникли с почтоматом необходимо обратиться в контакт-центр компании «Нова Пошта» по номеру 0 800 500 609.",
        c4p2: "По факту доставки можно произвести проверку посылки на целостность и работоспособность. В случае выявления повреждений, несоответствия товара или его комплектации, необходимо, в присутствии оператора отделения или курьера Новой почты, составить соответствующий акт и отказаться от получения посылки. После получения товара претензии к внешнему виду и комплектации не принимаются.",
        c4p3: "Для получения товара в почтомате необходимо установленное на смартфон приложение Новой Почты. В нем же оплачивается доставка посылки. В случае выявления повреждений, несоответствия товара или его комплектации, необходимо обратиться в любое отделение или позвонить в службу поддержки Новой Почты для подачи претензии.",

        c5h3: "Инструкция как пользоваться почтоматом: ",
        c5p1: "Ссылка на инструкцию: https://novaposhta.ua/poshtomat/?utm_source=site&utm_medium=referral&utm_campaign=npu_poshtomat_button",

        c6h3: "Стоимость доставки",
        c6p1: "1. Стоимость доставки рассчитывается индивидуально и зависит от веса, объема товара, а также населенного пункта.",
        c6p2: "2. Бесплатная доставка при 100% оплате товара от 2000 грн.",
        c6p3: "3. При оплате наложенным платежом, к сумме заказа прибавляется 20 грн+2% от стоимости товара (услуги Новой почты за пересылку денег).",

        c7h2: "Укрпочта",
        c7p1: "Доставка осуществляется в отделение Укрпочты в вашем городе",
        c7p2: "Заказ может быть на сумму до 50000 грн, не более 70 см (максимальная сторона) и весом до 30 кг.",

        c8h3:"Отправка осуществляется по тарифам Укрпочта:",
        c8p1: "Экспресс https://www.ukrposhta.ua/ua/taryfy-ukrposhta-ekspres",
        c8p2: "Стандарт https://www.ukrposhta.ua/ua/taryfy-ukrposhta-standart",
        c8p3: "Отправка товара транспортной компанией возможно только при полной оплате стоимости товара на расчетный счет ФЛП. Наложенный платеж отсутствует",
        c8p4: "Доставку оплачивает покупатель или интернет-магазин WINS в зависимости от информации указанной в товарах.",
        c8p5: "Чтобы получить отправление в отделении:",
        c8p6: "1. Проверьте по трекингу на сайте Укрпочта (https://track.ukrposhta.ua/tracking_UA.html) или в мобильном приложении (https://www.ukrposhta.ua/ua/onlain-servisy#mobile-app-block)",
        c8p7: "2. Найдите адрес своего отделения Укрпочты по индексу или домашнему адресу здесь (https://index.ukrposhta.ua/find-post-index)",
        c8p8: "3. Покажите работнику Укрпочты оригинал документа, удостоверяющего личность (паспорт, водительское удостоверение, вид на жительство и т. д.), или из приложения Дія или документ, который дает возможность получать отправления.",
        c8p9: "4. Получите свою посылку.",
        c8p10: "Сроки доставки зависят от ситуации в регионе.",
        c8p11: "По факту доставки вы имеете возможность проверить товар на целостность и работоспособность.",
        c8p12: "В случае обнаружения повреждений, несоответствия товара или его комплектации, необходимо в присутствии оператора отделения Укрпочты, составить соответствующий акт и отказаться от получения посылки.",
        c8p13: "После получения товара претензии к внешнему виду и комплектации не принимаются.",

        c9h3: "Стоимость доставки",
        c9p1: "1. Стоимость доставки рассчитывается индивидуально и зависит от веса, объема товара, а также населенного пункта.",
        c9p2: "2.   Бесплатная доставка при 100% оплате товара от 2000 грн.",
    };
    let mainLang = uk;

    useEffect(()=>{
        dispatch(languageOperations.getLanguage())
    }, [dispatch])

    if(language === "uk"){
        mainLang = uk;
    }
    if(language === "ru"){
        mainLang = ru;
    }

    return(
        <div className="wrapper delivery_block">
            <div className="delivery_title_block">
                <h1>{mainLang.title}</h1>
                <div></div>
            </div>
            <div className="delivery_content_block">
                <h2>{mainLang.c1h2}</h2>
                <p>{mainLang.c1p1}</p>
                <p>{mainLang.c1p2}</p>
                <p>{mainLang.c1p3}</p>
                <p>{mainLang.c1p4}</p>
                <p>{mainLang.c1p5}</p>
            </div>
            <div className="delivery_content_main_block">
                <h3>{mainLang.c2h3}</h3>
                <p>{mainLang.c2p1}</p>
                <p>{mainLang.c2p2}</p>
            </div>
            <div className="delivery_content_main_block">
                <h3>{mainLang.c3h3}</h3>
                <p>{mainLang.c3p1}</p>
                <p>{mainLang.c3p2}</p>
                <p>{mainLang.c3p3}</p>
                <p>{mainLang.c3p4}</p>
                <p>{mainLang.c3p5}</p>
                <p>{mainLang.c3p6}</p>
            </div>
            <div className="delivery_content_main_block">
                <h3>{mainLang.c4h3}</h3>
                <p>{mainLang.c4p1}</p>
                <div></div>
                <p>{mainLang.c4p2}</p>
                <div></div>
                <p>{mainLang.c4p3}</p>
            </div>
            <div className="delivery_content_main_block">
                <h3>{mainLang.c5h3}</h3>
                <p>{mainLang.c5p1}</p>
            </div>
            <div className="delivery_content_main_block">
                <h3>{mainLang.c6h3}</h3>
                <p>{mainLang.c6p1}</p>
                <p>{mainLang.c6p2}</p>
                <p>{mainLang.c6p3}</p>
            </div>
            <div className="delivery_content_block">
                <h2>{mainLang.c7h2}</h2>
                <p>{mainLang.c7p1}</p>
                <p>{mainLang.c7p2}</p>
            </div>
            <div className="delivery_content_main_block">
                <h3>{mainLang.c8h3}</h3>
                <p>{mainLang.c8p1}</p>
                <p>{mainLang.c8p2}</p>
                <p>{mainLang.c8p3}</p>
                <div></div>
                <p>{mainLang.c8p4}</p>
                <div></div>
                <p>{mainLang.c8p5}</p>
                <p>{mainLang.c8p6}</p>
                <p>{mainLang.c8p7}</p>
                <p>{mainLang.c8p8}</p>
                <p>{mainLang.c8p9}</p>
                <div></div>
                <p>{mainLang.c8p10}</p>
                <div></div>
                <p>{mainLang.c8p11}</p>
                <div></div>
                <p>{mainLang.c8p12}</p>
                <div></div>
                <p>{mainLang.c8p13}</p>
                <div></div>
            </div>
            <div className="delivery_content_main_block">
                <h3>{mainLang.c9h3}</h3>
                <p>{mainLang.c9p1}</p>
                <p>{mainLang.c9p2}</p>
            </div>
        </div>
    )
}

const mapStateToProps = (state) => {
    return {
        language: state.language.data,
    };
};

export default connect(mapStateToProps) (Delivery);
