import React, {useEffect} from "react";
import {connect} from "react-redux";
import {languageOperations} from "../../store/language";
import "./Payment.scss"


function Payment ({ dispatch, language }) {
    const uk = {
        title: "Оплата",
        h2: "Способи оплати",
        c1h3: "1. Повна оплата за товар на розрахунковий рахунок ФОП (IBAN)",
        c1p1: "При оформленні замовлення Ви вказуєте цей спосіб оплати та протягом робочого дня з вами зв'яжеться менеджер по телефону та через Telegram/Viber/WhatsApp, SMS або електронну пошту відправить реквізити для оплати замовлення. Після оплати за реквізитами Вам необхідно надіслати менеджеру скрін або фото чека оплати із зазначенням точного номера замовлення. Після зарахування коштів на наш рахунок, товар буде відправлено протягом 1 робочого дня, у разі затримки менеджер Вас повідомить. Замовлення обробляються щодня: пн-пт з 10:00 до 18:00, сб-нд з 14:00 до 18:00.",
        c2h3: "2. Повна оплата за товар на карту-ключ ФОП Монобанку",
        c2p2: "При оформленні замовлення Ви вказуєте цей спосіб оплати та протягом робочого дня з вами зв'яжеться менеджер по телефону та через Telegram/Viber/WhatsApp, SMS або електронну пошту відправить реквізити для оплати замовлення. Після оплати за реквізитами Вам необхідно надіслати менеджеру скрін або фото чека оплати із зазначенням точного номера замовлення. Після зарахування коштів на наш рахунок, товар буде відправлено протягом 1 робочого дня, у разі затримки менеджер Вас повідомить. Замовлення обробляються щодня: пн-пт з 10:00 до 18:00, сб-нд з 14:00 до 18:00.",
        c3h3: "3. Післяплати за частковою передоплатою (хв. сума передоплати 100 грн.)",
        c3p3: "При оформленні замовлення Ви вказуєте цей спосіб оплати та протягом робочого дня з вами зв'яжеться менеджер по телефону та через Telegram/Viber/WhatsApp, SMS або електронну пошту відправить реквізити для оплати замовлення. Після оплати за реквізитами Вам необхідно надіслати менеджеру скрін або фото чека оплати із зазначенням точного номера замовлення. Після зарахування коштів на наш рахунок, товар буде відправлено протягом 1 робочого дня, у разі затримки менеджер Вас повідомить. Замовлення обробляються щодня: пн-пт з 10:00 до 18:00, сб-нд з 14:00 до 18:00.",
    };
    const ru = {
        title: "Оплата",
        h2: "Способы оплаты",
        c1h3: "1. Полная оплата за товар на расчетный счет ФЛП (IBAN)",
        c1p1: "При оформлении заказа Вы указываете этот способ оплаты и в течении рабочего дня с вами свяжется менеджер по телефону и через Telegram/Viber/WhatsApp, SMS или электронную почту отправит реквизиты для оплаты заказа. После оплаты по реквизитам Вам необходимо отправить менеджеру скрин или фото чека оплаты с указанием точного номера заказа. После зачисления средств на наш счет, товар будет отправлен в течении 1 рабочего дня, в случае задержки менеджер Вас уведомит. Заказы обрабатываются ежедневно: пн-пт с 10:00 до 18:00, сб-вс с 14:00 до 18:00.",
        c2h3: "2. Полная оплата за товар на карту-ключ ФЛП Монобанка",
        c2p2: "При оформлении заказа Вы указываете этот способ оплаты и в течении рабочего дня с вами свяжется менеджер по телефону и через Telegram/Viber/WhatsApp, SMS или электронную почту отправит реквизиты для оплаты заказа. После оплаты по реквизитам Вам необходимо отправить менеджеру скрин или фото чека оплаты с указанием точного номера заказа. После зачисления средств на наш счет, товар будет отправлен в течение 1 рабочего дня, в случае задержки менеджер Вас уведомит. Заказы обрабатываются ежедневно: пн-пт с 10:00 до 18:00, сб-вс с 14:00 до 18:00.",
        c3h3: "3. Наложенный платеж по частичной предоплате (мин. сумма предоплаты 100 грн.)",
        c3p3: "При оформлении заказа Вы указываете этот способ оплаты и в течении рабочего дня с вами свяжется менеджерпо телефону и через Telegram/Viber/WhatsApp, SMS или электронную почту отправит реквизиты для оплаты заказа. После оплаты по реквизитам Вам необходимо отправить менеджеру скрин или фото чека оплаты с указанием точного номера заказа. После зачисления средств на наш счет, товар будет отправлен в течение 1 рабочего дня, в случае задержки менеджер Вас уведомит. Заказы обрабатываются ежедневно: пн-пт с 10:00 до 18:00, сб-вс с 14:00 до 18:00.",

    };
    let mainLang = uk;
    useEffect(()=>{
        dispatch(languageOperations.getLanguage())
    }, [dispatch])

    if(language === "uk"){
        mainLang = uk;
    }
    if(language === "ru"){
        mainLang = ru;
    }
    return(
        <div className="wrapper payment_block">
            <div className="payment_title_block">
                <h1>{mainLang.title}</h1>
                <div></div>
            </div>
            <div className="payment_content_block">
                <h2>{mainLang.h2}</h2>
            </div>
            <div className="payment_content_main_block">
                <h3>{mainLang.c1h3}</h3>
                <p>{mainLang.c1p1}</p>
            </div>
            <div className="payment_content_main_block">
                <h3>{mainLang.c2h3}</h3>
                <p>{mainLang.c2p2}</p>
            </div>
            <div className="payment_content_main_block">
                <h3>{mainLang.c3h3}</h3>
                <p>{mainLang.c3p3}</p>
            </div>
        </div>
    )
}
const mapStateToProps = (state) => {
    return {
        language: state.language.data,
    };
};

export default connect(mapStateToProps) (Payment);